Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectPicker Methods
The AnalysisObjectPicker type exposes the following members.
Methods
Name | Description
PickObject
 Prompts the user to pick object from the model with the given prompt. Object is either analysis object or model object.
PickObjects
 Prompts the user to pick objects from the model with the given prompt.
Top
See Also
Reference
AnalysisObjectPicker Class
Tekla.Structures.Analysis.UI Namespace